<h1>Chinook</h1>

The Chinook database contains information about the artists, songs, and albums from the music shop, as well as information on the shop's employees, customers, and the customers purchases.

Database from [Github](https://github.com/lerocha/chinook-database), modified and provided by DataQuest

In [1]:
!conda install -yc conda-forge ipython-sql

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

In [2]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

<h4>List all tables and views in database</h4>

In [3]:
%%sql
SELECT name,
       type
  FROM sqlite_master
 WHERE type IN ("table","view");

 * sqlite:///chinook.db
Done.

[('album', 'table'),
 ('artist', 'table'),
 ('customer', 'table'),
 ('employee', 'table'),
 ('genre', 'table'),
 ('invoice', 'table'),
 ('invoice_line', 'table'),
 ('media_type', 'table'),
 ('playlist', 'table'),
 ('playlist_track', 'table'),
 ('track', 'table'),
 ('customer_gt_90_dollars', 'view')]

<h2>Music</h2>
<h4>Top 5 albums</h4>
By number of times a track from that album has been purchased

In [4]:
%%sql
WITH ta AS (
        SELECT t.track_id,
               al.title AS album_title,
               ar.name AS artist_name
          FROM track AS t
    INNER JOIN album AS al ON al.album_id = t.album_id
    INNER JOIN artist AS ar ON ar.artist_id = al.artist_id) 


    SELECT ta.album_title AS album,
           ta.artist_name AS artist,
           COUNT(*) AS tracks_purchased
      FROM invoice_line AS il
INNER JOIN ta ON ta.track_id = il.track_id
  GROUP BY 1, 2
  ORDER BY 3 DESC 
     LIMIT 5;

 * sqlite:///chinook.db
Done.

[('Are You Experienced?', 'Jimi Hendrix', 187),
 ('Faceless', 'Godsmack', 96),
 ('Mezmerize', 'System Of A Down', 93),
 ('Get Born', 'JET', 90),
 ('The Doors', 'The Doors', 83)]

<h4>Top 10 genres that sell the most tracks in the USA</h4>

In [5]:
%%sql
WITH usa_tracks_sold AS (
        SELECT il.* 
          FROM invoice_line AS il
    INNER JOIN invoice AS i on il.invoice_id = i.invoice_id
    INNER JOIN customer AS c on i.customer_id = c.customer_id
         WHERE c.country = "USA")


    SELECT g.name genre,
           count(uts.invoice_line_id) tracks_sold,
           ROUND((CAST(COUNT(uts.invoice_line_id) AS Float) 
               / (SELECT COUNT(*) from usa_tracks_sold) * 100), 2)
               AS percentage_sold
      FROM usa_tracks_sold uts
INNER JOIN track t on t.track_id = uts.track_id
INNER JOIN genre g on g.genre_id = t.genre_id
  GROUP BY 1
  ORDER BY 2 DESC
     LIMIT 10;

 * sqlite:///chinook.db
Done.

[('Rock', 561, 53.38),
 ('Alternative & Punk', 130, 12.37),
 ('Metal', 124, 11.8),
 ('R&B/Soul', 53, 5.04),
 ('Blues', 36, 3.43),
 ('Alternative', 35, 3.33),
 ('Pop', 22, 2.09),
 ('Latin', 22, 2.09),
 ('Hip Hop/Rap', 20, 1.9),
 ('Jazz', 14, 1.33)]

<h2>Employees</h2>
<h4>Information about employee and supervisor</h4>

In [6]:
%%sql
   SELECT e1.first_name || " " || e1.last_name AS employee_name,
          e1.title AS employee_title,
          e2.first_name || " " || e2.last_name AS supervisor_name,
          e2.title AS supervisor_title
     FROM employee AS e1
LEFT JOIN employee AS e2 ON e1.reports_to = e2.employee_id
 ORDER BY 1;

 * sqlite:///chinook.db
Done.

[('Andrew Adams', 'General Manager', None, None),
 ('Jane Peacock', 'Sales Support Agent', 'Nancy Edwards', 'Sales Manager'),
 ('Laura Callahan', 'IT Staff', 'Michael Mitchell', 'IT Manager'),
 ('Margaret Park', 'Sales Support Agent', 'Nancy Edwards', 'Sales Manager'),
 ('Michael Mitchell', 'IT Manager', 'Andrew Adams', 'General Manager'),
 ('Nancy Edwards', 'Sales Manager', 'Andrew Adams', 'General Manager'),
 ('Robert King', 'IT Staff', 'Michael Mitchell', 'IT Manager'),
 ('Steve Johnson', 'Sales Support Agent', 'Nancy Edwards', 'Sales Manager')]

<h4>Best Sales Support Agents based on total_sales</h4>

In [7]:
%%sql
WITH support_agents AS (
         SELECT i.customer_id,
                c.support_rep_id,
                CAST(SUM(i.total) AS Integer) AS total
           FROM invoice AS i
     INNER JOIN customer AS c ON i.customer_id = c.customer_id
     GROUP BY 1,2)


    SELECT e.first_name || " " || e.last_name employee,
           e.hire_date,
           SUM(sa.total) total_sales
      FROM support_agents AS sa
INNER JOIN employee e ON e.employee_id = sa.support_rep_id
  GROUP BY 1;

 * sqlite:///chinook.db
Done.

[('Jane Peacock', '2017-04-01 00:00:00', 1723),
 ('Margaret Park', '2017-05-03 00:00:00', 1577),
 ('Steve Johnson', '2017-10-17 00:00:00', 1389)]

<h2>Customers</h2>
<h4>Expenses by customers</h4>

In [8]:
%%sql
    SELECT c.first_name || " " || c.last_name AS customer_name,
           COUNT(i.invoice_id) AS number_of_purchases,
           ROUND(SUM(i.total), 2) AS total_spent,
           CASE
           WHEN sum(i.total) < 40 THEN 'small spender'
           WHEN sum(i.total) > 100 THEN 'big spender'
           ELSE 'regular'
           END AS customer_category
      FROM invoice AS i
INNER JOIN customer AS c ON i.customer_id = c.customer_id
  GROUP BY 1 
  ORDER BY 4;

 * sqlite:///chinook.db
Done.

[('Fernanda Ramos', 15, 106.92, 'big spender'),
 ('František Wichterlová', 18, 144.54, 'big spender'),
 ('Helena Holý', 12, 128.7, 'big spender'),
 ("Hugh O'Reilly", 13, 114.84, 'big spender'),
 ('João Fernandes', 13, 102.96, 'big spender'),
 ('Luís Gonçalves', 13, 108.9, 'big spender'),
 ('Manoj Pareek', 13, 111.87, 'big spender'),
 ('Aaron Mitchell', 8, 70.29, 'regular'),
 ('Alexandre Rocha', 10, 69.3, 'regular'),
 ('Astrid Gruber', 9, 69.3, 'regular'),
 ('Bjørn Hansen', 9, 72.27, 'regular'),
 ('Camille Bernard', 9, 79.2, 'regular'),
 ('Daan Peeters', 7, 60.39, 'regular'),
 ('Dan Miller', 12, 95.04, 'regular'),
 ('Dominique Lefebvre', 9, 72.27, 'regular'),
 ('Eduardo Martins', 12, 60.39, 'regular'),
 ('Edward Francis', 13, 91.08, 'regular'),
 ('Ellie Sullivan', 12, 75.24, 'regular'),
 ('Emma Jones', 8, 68.31, 'regular'),
 ('Enrique Muñoz', 11, 98.01, 'regular'),
 ('Frank Harris', 8, 74.25, 'regular'),
 ('Frank Ralston', 8, 71.28, 'regular'),
 ('François Tremblay', 9, 99.99, 'regular'),
 ('Fynn Zimmermann', 10, 94.05, 'regular'),
 ('Hannah Schneider', 11, 85.14, 'regular'),
 ('Heather Leacock', 12, 92.07, 'regular'),
 ('Isabelle Mercier', 12, 73.26, 'regular'),
 ('Jack Smith', 12, 98.01, 'regular'),
 ('Jennifer Peterson', 9, 66.33, 'regular'),
 ('Joakim Johansson', 10, 75.24, 'regular'),
 ('Johannes Van der Berg', 10, 65.34, 'regular'),
 ('John Gordon', 10, 66.33, 'regular'),
 ('Julia Barnett', 10, 72.27, 'regular'),
 ('Kathy Chase', 11, 91.08, 'regular'),
 ('Ladislav Kovács', 10, 78.21, 'regular'),
 ('Leonie Köhler', 11, 82.17, 'regular'),
 ('Lucas Mancini', 9, 50.49, 'regular'),
 ('Luis Rojas', 13, 97.02, 'regular'),
 ('Madalena Sampaio', 16, 82.17, 'regular'),
 ('Marc Dubois', 9, 64.35, 'regular'),
 ('Mark Taylor', 10, 81.18, 'regular'),
 ('Martha Silk', 11, 62.37, 'regular'),
 ('Michelle Brooks', 8, 79.2, 'regular'),
 ('Niklas Schröder', 9, 73.26, 'regular'),
 ('Patrick Gray', 9, 84.15, 'regular'),
 ('Phil Hughes', 11, 98.01, 'regular'),
 ('Puja Srivastava', 8, 71.28, 'regular'),
 ('Richard Cunningham', 12, 86.13, 'regular'),
 ('Robert Brown', 4, 40.59, 'regular'),
 ('Roberto Almeida', 11, 82.17, 'regular'),
 ('Stanisław Wójcik', 10, 76.23, 'regular'),
 ('Steve Murray', 9, 79.2, 'regular'),
 ('Terhi Hämäläinen', 11, 79.2, 'regular'),
 ('Tim Goyer', 9, 54.45, 'regular'),
 ('Victor Stevens', 10, 76.23, 'regular'),
 ('Wyatt Girard', 11, 99.99, 'regular'),
 ('Diego Gutiérrez', 5, 39.6, 'small spender'),
 ('Kara Nielsen', 10, 37.62, 'small spender'),
 ('Mark Philips', 10, 29.7, 'small spender')]

<h4>Customers that have purchased more than $90</h4>

In [9]:
%%sql
CREATE VIEW customer_gt_90_dollars AS
        SELECT c.first_name || " " || c.last_name AS customer_name,
               c.phone,
               c.email,
               ROUND(SUM(i.total), 2) AS total_spent
          FROM invoice i
    INNER JOIN customer AS c ON i.customer_id = c.customer_id
      GROUP BY 1
        HAVING SUM(i.total) > 90;

        
SELECT *
  FROM customer_gt_90_dollars;

 * sqlite:///chinook.db
(sqlite3.OperationalError) table customer_gt_90_dollars already exists
[SQL: CREATE VIEW customer_gt_90_dollars AS
        SELECT c.first_name || " " || c.last_name AS customer_name,
               c.phone,
               c.email,
               ROUND(SUM(i.total), 2) AS total_spent
          FROM invoice i
    INNER JOIN customer AS c ON i.customer_id = c.customer_id
      GROUP BY 1
        HAVING SUM(i.total) > 90;]
(Background on this error at: http://sqlalche.me/e/e3q8)

<h4>Total_purchases from customers from India</h4>

In [10]:
%%sql
WITH
    customers_india AS (
           SELECT * 
             FROM customer
            WHERE country = "India"),
    sales_per_customer AS (
           SELECT customer_id,
                  CAST(SUM(total) as Integer) total
             FROM invoice
         GROUP BY 1)

    
    SELECT ci.first_name || " " || ci.last_name AS customer_name,
           spc.total AS total_purchases
      FROM customers_india AS ci
INNER JOIN sales_per_customer AS spc ON ci.customer_id = spc.customer_id
  ORDER BY 1;

 * sqlite:///chinook.db
Done.

[('Manoj Pareek', 111), ('Puja Srivastava', 71)]

<h4>Customer that spend the most per country</h4>

In [11]:
%%sql
WITH
    customer_country_purchases AS (
             SELECT i.customer_id,
                    c.country,
                    CAST(SUM(i.total) AS Integer) AS total_purchases
               FROM invoice AS i
         INNER JOIN customer AS c ON i.customer_id = c.customer_id
           GROUP BY 1, 2),
    
    country_max_purchase AS (
             SELECT country,
                    MAX(total_purchases) max_purchase
               FROM customer_country_purchases
           GROUP BY 1),
    
    country_best_customer AS (
             SELECT cmp.country,
                    cmp.max_purchase,
                    (SELECT ccp.customer_id
                       FROM customer_country_purchases ccp
                      WHERE ccp.country = cmp.country 
                        AND cmp.max_purchase = ccp.total_purchases) AS customer_id
               FROM country_max_purchase cmp)

    
    SELECT cbc.country AS country,
           c.first_name || " " || c.last_name AS customer_name,
           cbc.max_purchase AS total_purchased
      FROM customer AS c
INNER JOIN country_best_customer AS cbc ON cbc.customer_id = c.customer_id
  ORDER BY 1 ASC;

 * sqlite:///chinook.db
Done.

[('Argentina', 'Diego Gutiérrez', 39),
 ('Australia', 'Mark Taylor', 81),
 ('Austria', 'Astrid Gruber', 69),
 ('Belgium', 'Daan Peeters', 60),
 ('Brazil', 'Luís Gonçalves', 108),
 ('Canada', 'François Tremblay', 99),
 ('Chile', 'Luis Rojas', 97),
 ('Czech Republic', 'František Wichterlová', 144),
 ('Denmark', 'Kara Nielsen', 37),
 ('Finland', 'Terhi Hämäläinen', 79),
 ('France', 'Wyatt Girard', 99),
 ('Germany', 'Fynn Zimmermann', 94),
 ('Hungary', 'Ladislav Kovács', 78),
 ('India', 'Manoj Pareek', 111),
 ('Ireland', "Hugh O'Reilly", 114),
 ('Italy', 'Lucas Mancini', 50),
 ('Netherlands', 'Johannes Van der Berg', 65),
 ('Norway', 'Bjørn Hansen', 72),
 ('Poland', 'Stanisław Wójcik', 76),
 ('Portugal', 'João Fernandes', 102),
 ('Spain', 'Enrique Muñoz', 98),
 ('Sweden', 'Joakim Johansson', 75),
 ('USA', 'Jack Smith', 98),
 ('United Kingdom', 'Phil Hughes', 98)]